k6/run-webflux-100l-2000vu-30pool.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6-simple.js
        output: -

     scenarios: (100.00%) 1 scenario, 2000 max VUs, 2m25s max duration (incl. graceful stop):
              * ramp: Up to 2000 looping VUs for 2m15s over 4 stages (gracefulRampDown: 10s, gracefulStop: 30s)


running (0m00.9s), 0001/2000 VUs, 0 complete and 0 interrupted iterations
ramp   [   1% ] 0001/2000 VUs  0m00.9s/2m15.0s

running (0m01.9s), 0002/2000 VUs, 426 complete and 0 interrupted iterations
ramp   [   1% ] 0002/2000 VUs  0m01.9s/2m15.0s

running (0m02.9s), 0003/2000 VUs, 1406 complete and 0 interrupted iterations
ramp   [   2% ] 0003/2000 VUs  0m02.9s/2m15.0s

running (0m03.9s), 0005/2000 VUs, 3014 complete and 0 interrupted iterations
ramp   [   3% ] 0005/2000 VUs  0m03.9s/2m15.0s

running (0m04.9s), 0006/2000 VUs, 5575 complete and 0 interrupted iterations
ramp   [   4% ] 0006/2000 VUs  0m04.9s/2m15.0s

running (0m05.9s), 0007/2000 VUs, 8957 complete and 0 interrupted iterations
ramp   [   4% ] 0007/2000 VUs  0m05.9s/2m15.0s

running (0m06.9s), 0009/2000 VUs, 13018 complete and 0 interrupted iterations
ramp   [   5% ] 0009/2000 VUs  0m06.9s/2m15.0s

running (0m07.9s), 0010/2000 VUs, 17484 complete and 0 interrupted iterations
ramp   [   6% ] 0010/2000 VUs  0m07.9s/2m15.0s

running (0m08.9s), 0011/2000 VUs, 22338 complete and 0 interrupted iterations
ramp   [   7% ] 0011/2000 VUs  0m08.9s/2m15.0s

running (0m09.9s), 0013/2000 VUs, 26583 complete and 0 interrupted iterations
ramp   [   7% ] 0013/2000 VUs  0m09.9s/2m15.0s

running (0m10.9s), 0014/2000 VUs, 31121 complete and 0 interrupted iterations
ramp   [   8% ] 0014/2000 VUs  0m10.9s/2m15.0s

running (0m11.9s), 0015/2000 VUs, 35565 complete and 0 interrupted iterations
ramp   [   9% ] 0015/2000 VUs  0m11.9s/2m15.0s

running (0m12.9s), 0017/2000 VUs, 39798 complete and 0 interrupted iterations
ramp   [  10% ] 0017/2000 VUs  0m12.9s/2m15.0s

running (0m13.9s), 0018/2000 VUs, 43989 complete and 0 interrupted iterations
ramp   [  10% ] 0018/2000 VUs  0m13.9s/2m15.0s

running (0m14.9s), 0019/2000 VUs, 48132 complete and 0 interrupted iterations
ramp   [  11% ] 0019/2000 VUs  0m14.9s/2m15.0s

running (0m15.9s), 0060/2000 VUs, 53224 complete and 0 interrupted iterations
ramp   [  12% ] 0060/2000 VUs  0m15.9s/2m15.0s

running (0m16.9s), 0104/2000 VUs, 58593 complete and 0 interrupted iterations
ramp   [  13% ] 0104/2000 VUs  0m16.9s/2m15.0s

running (0m17.9s), 0148/2000 VUs, 64061 complete and 0 interrupted iterations
ramp   [  13% ] 0148/2000 VUs  0m17.9s/2m15.0s

running (0m18.9s), 0192/2000 VUs, 69719 complete and 0 interrupted iterations
ramp   [  14% ] 0192/2000 VUs  0m18.9s/2m15.0s

running (0m19.9s), 0236/2000 VUs, 75058 complete and 0 interrupted iterations
ramp   [  15% ] 0236/2000 VUs  0m19.9s/2m15.0s

running (0m20.9s), 0281/2000 VUs, 80586 complete and 0 interrupted iterations
ramp   [  16% ] 0281/2000 VUs  0m20.9s/2m15.0s

running (0m21.9s), 0324/2000 VUs, 86107 complete and 0 interrupted iterations
ramp   [  16% ] 0324/2000 VUs  0m21.9s/2m15.0s

running (0m22.9s), 0368/2000 VUs, 91565 complete and 0 interrupted iterations
ramp   [  17% ] 0368/2000 VUs  0m22.9s/2m15.0s

running (0m23.9s), 0412/2000 VUs, 97263 complete and 0 interrupted iterations
ramp   [  18% ] 0412/2000 VUs  0m23.9s/2m15.0s

running (0m24.9s), 0456/2000 VUs, 102709 complete and 0 interrupted iterations
ramp   [  18% ] 0456/2000 VUs  0m24.9s/2m15.0s

running (0m25.9s), 0500/2000 VUs, 108349 complete and 0 interrupted iterations
ramp   [  19% ] 0500/2000 VUs  0m25.9s/2m15.0s

running (0m26.9s), 0544/2000 VUs, 113873 complete and 0 interrupted iterations
ramp   [  20% ] 0544/2000 VUs  0m26.9s/2m15.0s

running (0m27.9s), 0588/2000 VUs, 119516 complete and 0 interrupted iterations
ramp   [  21% ] 0588/2000 VUs  0m27.9s/2m15.0s

running (0m28.9s), 0632/2000 VUs, 125154 complete and 0 interrupted iterations
ramp   [  21% ] 0632/2000 VUs  0m28.9s/2m15.0s

running (0m29.9s), 0676/2000 VUs, 130535 complete and 0 interrupted iterations
ramp   [  22% ] 0676/2000 VUs  0m29.9s/2m15.0s

running (0m30.9s), 0720/2000 VUs, 136024 complete and 0 interrupted iterations
ramp   [  23% ] 0720/2000 VUs  0m30.9s/2m15.0s

running (0m31.9s), 0764/2000 VUs, 141785 complete and 0 interrupted iterations
ramp   [  24% ] 0764/2000 VUs  0m31.9s/2m15.0s

running (0m32.9s), 0808/2000 VUs, 147347 complete and 0 interrupted iterations
ramp   [  24% ] 0808/2000 VUs  0m32.9s/2m15.0s

running (0m33.9s), 0852/2000 VUs, 152887 complete and 0 interrupted iterations
ramp   [  25% ] 0852/2000 VUs  0m33.9s/2m15.0s

running (0m34.9s), 0896/2000 VUs, 158244 complete and 0 interrupted iterations
ramp   [  26% ] 0896/2000 VUs  0m34.9s/2m15.0s

running (0m35.9s), 0940/2000 VUs, 163838 complete and 0 interrupted iterations
ramp   [  27% ] 0940/2000 VUs  0m35.9s/2m15.0s

running (0m36.9s), 0984/2000 VUs, 169370 complete and 0 interrupted iterations
ramp   [  27% ] 0984/2000 VUs  0m36.9s/2m15.0s

running (0m37.9s), 1028/2000 VUs, 174922 complete and 0 interrupted iterations
ramp   [  28% ] 1028/2000 VUs  0m37.9s/2m15.0s

running (0m38.9s), 1072/2000 VUs, 180323 complete and 0 interrupted iterations
ramp   [  29% ] 1072/2000 VUs  0m38.9s/2m15.0s

running (0m39.9s), 1116/2000 VUs, 185276 complete and 0 interrupted iterations
ramp   [  30% ] 1116/2000 VUs  0m39.9s/2m15.0s

running (0m40.9s), 1160/2000 VUs, 190526 complete and 0 interrupted iterations
ramp   [  30% ] 1160/2000 VUs  0m40.9s/2m15.0s

running (0m41.9s), 1204/2000 VUs, 195939 complete and 0 interrupted iterations
ramp   [  31% ] 1204/2000 VUs  0m41.9s/2m15.0s

running (0m42.9s), 1248/2000 VUs, 201383 complete and 0 interrupted iterations
ramp   [  32% ] 1248/2000 VUs  0m42.9s/2m15.0s

running (0m43.9s), 1292/2000 VUs, 206891 complete and 0 interrupted iterations
ramp   [  33% ] 1292/2000 VUs  0m43.9s/2m15.0s

running (0m44.9s), 1336/2000 VUs, 212168 complete and 0 interrupted iterations
ramp   [  33% ] 1336/2000 VUs  0m44.9s/2m15.0s

running (0m45.9s), 1380/2000 VUs, 217717 complete and 0 interrupted iterations
ramp   [  34% ] 1380/2000 VUs  0m45.9s/2m15.0s

running (0m46.9s), 1424/2000 VUs, 223129 complete and 0 interrupted iterations
ramp   [  35% ] 1424/2000 VUs  0m46.9s/2m15.0s

running (0m47.9s), 1468/2000 VUs, 228576 complete and 0 interrupted iterations
ramp   [  36% ] 1468/2000 VUs  0m47.9s/2m15.0s

running (0m48.9s), 1512/2000 VUs, 234075 complete and 0 interrupted iterations
ramp   [  36% ] 1512/2000 VUs  0m48.9s/2m15.0s

running (0m49.9s), 1556/2000 VUs, 239678 complete and 0 interrupted iterations
ramp   [  37% ] 1556/2000 VUs  0m49.9s/2m15.0s

running (0m50.9s), 1600/2000 VUs, 245300 complete and 0 interrupted iterations
ramp   [  38% ] 1600/2000 VUs  0m50.9s/2m15.0s

running (0m51.9s), 1644/2000 VUs, 250670 complete and 0 interrupted iterations
ramp   [  38% ] 1644/2000 VUs  0m51.9s/2m15.0s

running (0m52.9s), 1688/2000 VUs, 256092 complete and 0 interrupted iterations
ramp   [  39% ] 1688/2000 VUs  0m52.9s/2m15.0s

running (0m53.9s), 1732/2000 VUs, 261654 complete and 0 interrupted iterations
ramp   [  40% ] 1732/2000 VUs  0m53.9s/2m15.0s

running (0m54.9s), 1776/2000 VUs, 266934 complete and 0 interrupted iterations
ramp   [  41% ] 1776/2000 VUs  0m54.9s/2m15.0s

running (0m55.9s), 1820/2000 VUs, 272628 complete and 0 interrupted iterations
ramp   [  41% ] 1820/2000 VUs  0m55.9s/2m15.0s

running (0m56.9s), 1864/2000 VUs, 278105 complete and 0 interrupted iterations
ramp   [  42% ] 1864/2000 VUs  0m56.9s/2m15.0s

running (0m57.9s), 1908/2000 VUs, 283494 complete and 0 interrupted iterations
ramp   [  43% ] 1908/2000 VUs  0m57.9s/2m15.0s

running (0m58.9s), 1952/2000 VUs, 288938 complete and 0 interrupted iterations
ramp   [  44% ] 1952/2000 VUs  0m58.9s/2m15.0s

running (0m59.9s), 1996/2000 VUs, 294191 complete and 0 interrupted iterations
ramp   [  44% ] 1996/2000 VUs  0m59.9s/2m15.0s

running (1m00.9s), 2000/2000 VUs, 299641 complete and 0 interrupted iterations
ramp   [  45% ] 2000/2000 VUs  1m00.9s/2m15.0s

running (1m01.9s), 2000/2000 VUs, 305153 complete and 0 interrupted iterations
ramp   [  46% ] 2000/2000 VUs  1m01.9s/2m15.0s

running (1m02.9s), 2000/2000 VUs, 310590 complete and 0 interrupted iterations
ramp   [  47% ] 2000/2000 VUs  1m02.9s/2m15.0s

running (1m03.9s), 2000/2000 VUs, 315898 complete and 0 interrupted iterations
ramp   [  47% ] 2000/2000 VUs  1m03.9s/2m15.0s

running (1m04.9s), 2000/2000 VUs, 321248 complete and 0 interrupted iterations
ramp   [  48% ] 2000/2000 VUs  1m04.9s/2m15.0s

running (1m05.9s), 2000/2000 VUs, 326479 complete and 0 interrupted iterations
ramp   [  49% ] 2000/2000 VUs  1m05.9s/2m15.0s

running (1m06.9s), 2000/2000 VUs, 331896 complete and 0 interrupted iterations
ramp   [  50% ] 2000/2000 VUs  1m06.9s/2m15.0s

running (1m07.9s), 2000/2000 VUs, 337058 complete and 0 interrupted iterations
ramp   [  50% ] 2000/2000 VUs  1m07.9s/2m15.0s

running (1m08.9s), 2000/2000 VUs, 342382 complete and 0 interrupted iterations
ramp   [  51% ] 2000/2000 VUs  1m08.9s/2m15.0s

running (1m09.9s), 2000/2000 VUs, 347690 complete and 0 interrupted iterations
ramp   [  52% ] 2000/2000 VUs  1m09.9s/2m15.0s

running (1m10.9s), 2000/2000 VUs, 353064 complete and 0 interrupted iterations
ramp   [  53% ] 2000/2000 VUs  1m10.9s/2m15.0s

running (1m11.9s), 2000/2000 VUs, 358332 complete and 0 interrupted iterations
ramp   [  53% ] 2000/2000 VUs  1m11.9s/2m15.0s

running (1m12.9s), 2000/2000 VUs, 363542 complete and 0 interrupted iterations
ramp   [  54% ] 2000/2000 VUs  1m12.9s/2m15.0s

running (1m13.9s), 2000/2000 VUs, 368737 complete and 0 interrupted iterations
ramp   [  55% ] 2000/2000 VUs  1m13.9s/2m15.0s

running (1m14.9s), 2000/2000 VUs, 373847 complete and 0 interrupted iterations
ramp   [  56% ] 2000/2000 VUs  1m14.9s/2m15.0s

running (1m15.9s), 2000/2000 VUs, 378985 complete and 0 interrupted iterations
ramp   [  56% ] 2000/2000 VUs  1m15.9s/2m15.0s

running (1m16.9s), 2000/2000 VUs, 384336 complete and 0 interrupted iterations
ramp   [  57% ] 2000/2000 VUs  1m16.9s/2m15.0s

running (1m17.9s), 2000/2000 VUs, 389677 complete and 0 interrupted iterations
ramp   [  58% ] 2000/2000 VUs  1m17.9s/2m15.0s

running (1m18.9s), 2000/2000 VUs, 395258 complete and 0 interrupted iterations
ramp   [  58% ] 2000/2000 VUs  1m18.9s/2m15.0s

running (1m19.9s), 2000/2000 VUs, 400504 complete and 0 interrupted iterations
ramp   [  59% ] 2000/2000 VUs  1m19.9s/2m15.0s

running (1m20.9s), 2000/2000 VUs, 406054 complete and 0 interrupted iterations
ramp   [  60% ] 2000/2000 VUs  1m20.9s/2m15.0s

running (1m21.9s), 2000/2000 VUs, 411426 complete and 0 interrupted iterations
ramp   [  61% ] 2000/2000 VUs  1m21.9s/2m15.0s

running (1m22.9s), 2000/2000 VUs, 416986 complete and 0 interrupted iterations
ramp   [  61% ] 2000/2000 VUs  1m22.9s/2m15.0s

running (1m23.9s), 2000/2000 VUs, 422458 complete and 0 interrupted iterations
ramp   [  62% ] 2000/2000 VUs  1m23.9s/2m15.0s

running (1m24.9s), 2000/2000 VUs, 427608 complete and 0 interrupted iterations
ramp   [  63% ] 2000/2000 VUs  1m24.9s/2m15.0s

running (1m25.9s), 2000/2000 VUs, 432911 complete and 0 interrupted iterations
ramp   [  64% ] 2000/2000 VUs  1m25.9s/2m15.0s

running (1m26.9s), 2000/2000 VUs, 438090 complete and 0 interrupted iterations
ramp   [  64% ] 2000/2000 VUs  1m26.9s/2m15.0s

running (1m27.9s), 2000/2000 VUs, 443413 complete and 0 interrupted iterations
ramp   [  65% ] 2000/2000 VUs  1m27.9s/2m15.0s

running (1m28.9s), 2000/2000 VUs, 448853 complete and 0 interrupted iterations
ramp   [  66% ] 2000/2000 VUs  1m28.9s/2m15.0s

running (1m29.9s), 2000/2000 VUs, 453873 complete and 0 interrupted iterations
ramp   [  67% ] 2000/2000 VUs  1m29.9s/2m15.0s

running (1m30.9s), 2000/2000 VUs, 459202 complete and 0 interrupted iterations
ramp   [  67% ] 2000/2000 VUs  1m30.9s/2m15.0s

running (1m31.9s), 2000/2000 VUs, 464921 complete and 0 interrupted iterations
ramp   [  68% ] 2000/2000 VUs  1m31.9s/2m15.0s

running (1m32.9s), 2000/2000 VUs, 470323 complete and 0 interrupted iterations
ramp   [  69% ] 2000/2000 VUs  1m32.9s/2m15.0s

running (1m33.9s), 2000/2000 VUs, 475533 complete and 0 interrupted iterations
ramp   [  70% ] 2000/2000 VUs  1m33.9s/2m15.0s

running (1m34.9s), 2000/2000 VUs, 480619 complete and 0 interrupted iterations
ramp   [  70% ] 2000/2000 VUs  1m34.9s/2m15.0s

running (1m35.9s), 2000/2000 VUs, 486198 complete and 0 interrupted iterations
ramp   [  71% ] 2000/2000 VUs  1m35.9s/2m15.0s

running (1m36.9s), 2000/2000 VUs, 491704 complete and 0 interrupted iterations
ramp   [  72% ] 2000/2000 VUs  1m36.9s/2m15.0s

running (1m37.9s), 2000/2000 VUs, 496957 complete and 0 interrupted iterations
ramp   [  73% ] 2000/2000 VUs  1m37.9s/2m15.0s

running (1m38.9s), 2000/2000 VUs, 502310 complete and 0 interrupted iterations
ramp   [  73% ] 2000/2000 VUs  1m38.9s/2m15.0s

running (1m39.9s), 2000/2000 VUs, 507616 complete and 0 interrupted iterations
ramp   [  74% ] 2000/2000 VUs  1m39.9s/2m15.0s

running (1m40.9s), 2000/2000 VUs, 512882 complete and 0 interrupted iterations
ramp   [  75% ] 2000/2000 VUs  1m40.9s/2m15.0s

running (1m41.9s), 2000/2000 VUs, 518146 complete and 0 interrupted iterations
ramp   [  76% ] 2000/2000 VUs  1m41.9s/2m15.0s

running (1m42.9s), 2000/2000 VUs, 523694 complete and 0 interrupted iterations
ramp   [  76% ] 2000/2000 VUs  1m42.9s/2m15.0s

running (1m43.9s), 2000/2000 VUs, 529216 complete and 0 interrupted iterations
ramp   [  77% ] 2000/2000 VUs  1m43.9s/2m15.0s

running (1m44.9s), 2000/2000 VUs, 534423 complete and 0 interrupted iterations
ramp   [  78% ] 2000/2000 VUs  1m44.9s/2m15.0s

running (1m45.9s), 2000/2000 VUs, 539624 complete and 0 interrupted iterations
ramp   [  78% ] 2000/2000 VUs  1m45.9s/2m15.0s

running (1m46.9s), 2000/2000 VUs, 544904 complete and 0 interrupted iterations
ramp   [  79% ] 2000/2000 VUs  1m46.9s/2m15.0s

running (1m47.9s), 2000/2000 VUs, 550192 complete and 0 interrupted iterations
ramp   [  80% ] 2000/2000 VUs  1m47.9s/2m15.0s

running (1m48.9s), 2000/2000 VUs, 555588 complete and 0 interrupted iterations
ramp   [  81% ] 2000/2000 VUs  1m48.9s/2m15.0s

running (1m49.9s), 2000/2000 VUs, 560623 complete and 0 interrupted iterations
ramp   [  81% ] 2000/2000 VUs  1m49.9s/2m15.0s

running (1m50.9s), 2000/2000 VUs, 565849 complete and 0 interrupted iterations
ramp   [  82% ] 2000/2000 VUs  1m50.9s/2m15.0s

running (1m51.9s), 2000/2000 VUs, 571084 complete and 0 interrupted iterations
ramp   [  83% ] 2000/2000 VUs  1m51.9s/2m15.0s

running (1m52.9s), 2000/2000 VUs, 576258 complete and 0 interrupted iterations
ramp   [  84% ] 2000/2000 VUs  1m52.9s/2m15.0s

running (1m53.9s), 2000/2000 VUs, 581484 complete and 0 interrupted iterations
ramp   [  84% ] 2000/2000 VUs  1m53.9s/2m15.0s

running (1m54.9s), 2000/2000 VUs, 586551 complete and 0 interrupted iterations
ramp   [  85% ] 2000/2000 VUs  1m54.9s/2m15.0s

running (1m55.9s), 2000/2000 VUs, 591828 complete and 0 interrupted iterations
ramp   [  86% ] 2000/2000 VUs  1m55.9s/2m15.0s

running (1m56.9s), 2000/2000 VUs, 597191 complete and 0 interrupted iterations
ramp   [  87% ] 2000/2000 VUs  1m56.9s/2m15.0s

running (1m57.9s), 2000/2000 VUs, 602669 complete and 0 interrupted iterations
ramp   [  87% ] 2000/2000 VUs  1m57.9s/2m15.0s

running (1m58.9s), 2000/2000 VUs, 608047 complete and 0 interrupted iterations
ramp   [  88% ] 2000/2000 VUs  1m58.9s/2m15.0s

running (1m59.9s), 2000/2000 VUs, 613252 complete and 0 interrupted iterations
ramp   [  89% ] 2000/2000 VUs  1m59.9s/2m15.0s

running (2m00.9s), 1897/2000 VUs, 618579 complete and 0 interrupted iterations
ramp   [  90% ] 1897/2000 VUs  2m00.9s/2m15.0s

running (2m01.9s), 1765/2000 VUs, 623789 complete and 0 interrupted iterations
ramp   [  90% ] 1765/2000 VUs  2m01.9s/2m15.0s

running (2m02.9s), 1630/2000 VUs, 629143 complete and 0 interrupted iterations
ramp   [  91% ] 1630/2000 VUs  2m02.9s/2m15.0s

running (2m03.9s), 1500/2000 VUs, 634570 complete and 0 interrupted iterations
ramp   [  92% ] 1500/2000 VUs  2m03.9s/2m15.0s

running (2m04.9s), 1362/2000 VUs, 639831 complete and 0 interrupted iterations
ramp   [  93% ] 1362/2000 VUs  2m04.9s/2m15.0s

running (2m05.9s), 1230/2000 VUs, 645224 complete and 0 interrupted iterations
ramp   [  93% ] 1230/2000 VUs  2m05.9s/2m15.0s

running (2m06.9s), 1088/2000 VUs, 650540 complete and 0 interrupted iterations
ramp   [  94% ] 1088/2000 VUs  2m06.9s/2m15.0s

running (2m07.9s), 0956/2000 VUs, 655904 complete and 0 interrupted iterations
ramp   [  95% ] 0956/2000 VUs  2m07.9s/2m15.0s

running (2m08.9s), 0818/2000 VUs, 661516 complete and 0 interrupted iterations
ramp   [  96% ] 0818/2000 VUs  2m08.9s/2m15.0s

running (2m09.9s), 0685/2000 VUs, 666904 complete and 0 interrupted iterations
ramp   [  96% ] 0685/2000 VUs  2m09.9s/2m15.0s

running (2m10.9s), 0549/2000 VUs, 672492 complete and 0 interrupted iterations
ramp   [  97% ] 0549/2000 VUs  2m10.9s/2m15.0s

running (2m11.9s), 0418/2000 VUs, 678039 complete and 0 interrupted iterations
ramp   [  98% ] 0418/2000 VUs  2m11.9s/2m15.0s

running (2m12.9s), 0279/2000 VUs, 683675 complete and 0 interrupted iterations
ramp   [  98% ] 0279/2000 VUs  2m12.9s/2m15.0s

running (2m13.9s), 0144/2000 VUs, 689355 complete and 0 interrupted iterations
ramp   [  99% ] 0144/2000 VUs  2m13.9s/2m15.0s

running (2m14.9s), 0010/2000 VUs, 694591 complete and 0 interrupted iterations
ramp   [ 100% ] 0010/2000 VUs  2m14.9s/2m15.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=395.88ms

    http_req_failed
    ✓ 'rate<0.02' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 694768  5146.351824/s
    checks_succeeded...: 100.00% 694768 out of 694768
    checks_failed......: 0.00%   0 out of 694768

    ✓ 200

    HTTP
    http_req_duration..............: avg=260.15ms min=1.33ms med=339.18ms max=490.7ms  p(90)=388.94ms p(95)=395.88ms
      { expected_response:true }...: avg=260.15ms min=1.33ms med=339.18ms max=490.7ms  p(90)=388.94ms p(95)=395.88ms
    http_req_failed................: 0.00%  0 out of 694768
    http_reqs......................: 694768 5146.351824/s

    EXECUTION
    iteration_duration.............: avg=260.18ms min=1.35ms med=339.21ms max=497.72ms p(90)=388.97ms p(95)=395.9ms 
    iterations.....................: 694768 5146.351824/s
    vus............................: 9      min=1           max=2000
    vus_max........................: 2000   min=2000        max=2000

    NETWORK
    data_received..................: 15 GB  111 MB/s
    data_sent......................: 79 MB  582 kB/s



running (2m15.0s), 0000/2000 VUs, 694768 complete and 0 interrupted iterations
ramp ✓ [ 100% ] 0000/2000 VUs  2m15s